# **CHAPTER 7**
# **Data Cleaning and Preparation**

## **7.1 Handling Missing Data**

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0]=None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### **Filtering Out Missing Data**

In [13]:
from numpy import nan as NA

In [16]:
data=pd.Series([1,Na,3.5,NA,7])

In [17]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [19]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [23]:
cleaned=data.dropna()#NA olan bütün satırları düşürdü. Bir tane bile NA değer varsa bütün satırı düşürür

In [24]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [25]:
data.dropna(how='all')# bütün satır NA ise satırı düşürdü

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [26]:
data[4]=NA#4.sütun hepsi NaN değerlerden oluşan

In [27]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [28]:
data.dropna(axis=1,how='all')# Bütün değerleri Nan olan sütunu düşürdü

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [35]:
df=pd.DataFrame(np.random.randn(7,3))

In [36]:
df.iloc[:4,1]=NA# 0,1,2,3 satır daki 1.sütundaki değerleri Na yapıyor

In [37]:
df.iloc[:2,2]=NA# 0,1 satırdaki 2.sütundaki

In [33]:
df

          0         1         2
0  0.011762       NaN       NaN
1 -1.133186       NaN       NaN
2  1.409459       NaN  1.983643
3  1.307372       NaN -0.852935
4  0.562114 -0.317223 -1.925702
5 -0.170206  0.449144 -1.205368
6 -0.061716  0.155743 -0.527393

In [34]:
df.dropna()

          0         1         2
4  0.562114 -0.317223 -1.925702
5 -0.170206  0.449144 -1.205368
6 -0.061716  0.155743 -0.527393

In [38]:
df.dropna(thresh=2)# Yalnızca Na olmayan en az 2 değere sahip satırları tutar

          0         1         2
2 -1.286676       NaN  0.027618
3 -0.872796       NaN  0.422522
4 -0.847144  2.436101 -0.187910
5 -0.616959 -1.014195 -0.897310
6  0.049603 -0.959031 -0.638575

### **Filling In Missing Data**

In [39]:
df.fillna(0)# Na değerleri 0 ile değiştiriyor

          0         1         2
0  0.548111  0.000000  0.000000
1 -0.023170  0.000000  0.000000
2 -1.286676  0.000000  0.027618
3 -0.872796  0.000000  0.422522
4 -0.847144  2.436101 -0.187910
5 -0.616959 -1.014195 -0.897310
6  0.049603 -0.959031 -0.638575

In [40]:
df.fillna({1:0.5,2:0})# 1.sütundaki Na değerleri 0.5 ile 2 sütundaki verileri 0 ile değiştiriyor

          0         1         2
0  0.548111  0.500000  0.000000
1 -0.023170  0.500000  0.000000
2 -1.286676  0.500000  0.027618
3 -0.872796  0.500000  0.422522
4 -0.847144  2.436101 -0.187910
5 -0.616959 -1.014195 -0.897310
6  0.049603 -0.959031 -0.638575

In [41]:
_=df.fillna(0,inplace=True)# Kalıcı değişiklik yapıyor

In [42]:
df

          0         1         2
0  0.548111  0.000000  0.000000
1 -0.023170  0.000000  0.000000
2 -1.286676  0.000000  0.027618
3 -0.872796  0.000000  0.422522
4 -0.847144  2.436101 -0.187910
5 -0.616959 -1.014195 -0.897310
6  0.049603 -0.959031 -0.638575

In [49]:
df=pd.DataFrame(np.random.randn(6,3))

In [50]:
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA

In [51]:
df

          0         1         2
0 -0.165535 -1.314856  0.746420
1  0.485068  0.457917 -0.705274
2 -0.105295       NaN  0.551196
3 -1.843462       NaN -0.316525
4  0.412626       NaN       NaN
5 -0.176053       NaN       NaN

In [48]:
df.fillna(method='ffill')# boş olmayan değerleri ileriye veya geriye doğru yayabiliriz.

          0         1         2
0 -0.773331  1.570069 -0.517912
1  0.828808  0.447881 -1.073430
2  0.890076  0.447881 -0.487047
3 -0.471305  0.447881 -0.345904
4  1.192764  0.447881 -0.345904
5  0.070399  0.447881 -0.345904

In [53]:
df.fillna(method='ffill',limit=2)# Yalnızca ilk iki Nan değerini değiştirir

          0         1         2
0 -0.165535 -1.314856  0.746420
1  0.485068  0.457917 -0.705274
2 -0.105295  0.457917  0.551196
3 -1.843462  0.457917 -0.316525
4  0.412626       NaN -0.316525
5 -0.176053       NaN -0.316525

In [54]:
data=pd.Series([1.,NA,3.5,NA,7])

In [56]:
data.fillna(data.mean())# Nan değerleri ortalaması ile değiştirir (1+3.5+7)/3=3.83

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

 ## **7.2 Data Transformation**

### **Removing Duplicates**

In [57]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [58]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
data.duplicated()# bir önceki satırda aynı değer varmı yok mu onu döndürüyor

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [60]:
data.drop_duplicates()# Tekrar eden satırı silerek döndürür

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [61]:
data['v1']=range(7)

In [62]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [63]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [64]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### **Transforming Data Using a Function or Mapping**

In [28]:
import pandas as pd
data=pd.DataFrame({'food':['bacon','pulled pork','bacon',
                                                        'Pastrami','corned beef','Bacon',
                                                         'pastrami','honey ham','nova lox'],
                                        'ounces':[4,3,12,6,7.5,8,3,5,6]
                                          })

In [29]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [31]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [32]:
lowercased = data['food'].str.lower()# food sütunundakilerin hepsini küçük harf yaptı

In [24]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal']=lowercased.map(meat_to_animal)

In [34]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [35]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### **Replacing Values**

In [36]:
data=pd.Series([1.,-999,2.,-999.,-1000.,3.])

In [37]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
import numpy as np
data.replace(-999,np.nan)#-999 olanları Nan ile değiştirdi

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace([-999,-1000],np.nan)#-1000 ve -999 olanlar nan ile değiştirildi

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [41]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### **Renaming Axis Indexes**

In [48]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                 index=['Ohio','Colorado','New York'],
                 columns=['one','two','three','four'])

In [49]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [50]:
transform=lambda x:x[:4].upper()

In [51]:
data.index.map(transform)#transform işlevini data'daki indexlere uyguladı

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [52]:
data.index=data.index.map(transform )

In [53]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)#kalıcı değişiklik

In [57]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### **Discretization and Binning**

In [58]:
ages=[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [59]:
bins=[18,25,35,60,100]

In [60]:
cats=pd.cut(ages,bins)#bin'lere böldük

In [61]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [62]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [63]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [65]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [66]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [67]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [68]:
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [69]:
data=np.random.rand(20)

In [70]:
pd.cut(data,4,precision=2)

[(0.74, 0.98], (0.74, 0.98], (0.74, 0.98], (0.28, 0.51], (0.74, 0.98], ..., (0.74, 0.98], (0.05, 0.28], (0.05, 0.28], (0.51, 0.74], (0.05, 0.28]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.98]]

In [71]:
data=np.random.randn(1000) #Normally distributed

In [73]:
cats=pd.qcut(data,4)# cut into quartiles

In [74]:
cats

[(0.0434, 0.677], (-2.589, -0.7], (0.677, 4.617], (0.677, 4.617], (0.677, 4.617], ..., (-0.7, 0.0434], (0.677, 4.617], (-2.589, -0.7], (0.0434, 0.677], (0.677, 4.617]]
Length: 1000
Categories (4, interval[float64]): [(-2.589, -0.7] < (-0.7, 0.0434] < (0.0434, 0.677] < (0.677, 4.617]]

In [75]:
pd.value_counts(cats)

(0.677, 4.617]     250
(0.0434, 0.677]    250
(-0.7, 0.0434]     250
(-2.589, -0.7]     250
dtype: int64

In [76]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(0.0434, 1.307], (-1.26, 0.0434], (0.0434, 1.307], (0.0434, 1.307], (0.0434, 1.307], ..., (-1.26, 0.0434], (0.0434, 1.307], (-2.589, -1.26], (0.0434, 1.307], (0.0434, 1.307]]
Length: 1000
Categories (4, interval[float64]): [(-2.589, -1.26] < (-1.26, 0.0434] < (0.0434, 1.307] < (1.307, 4.617]]

### **Detecting and Filtering Outliers**

In [80]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [88]:
data

            0         1         2         3
0    0.100666 -0.996658  1.249113  0.391136
1   -0.181167  2.045981 -1.594452 -0.258158
2    0.760345 -2.687289  0.039917  0.112657
3   -0.009405  2.165975 -0.034589  1.276214
4    0.941177  0.202716  0.395325 -2.737315
..        ...       ...       ...       ...
995 -1.147834  0.978160 -0.398095 -1.792133
996  0.737197  0.869799 -0.626059 -0.042416
997  0.134819  0.306902 -1.377794  0.860620
998  0.195902  0.734710 -0.576234  0.163128
999 -1.860463  0.604156 -0.559720  1.393122

[1000 rows x 4 columns]

In [82]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013178    -0.006799     0.051762     0.005132
std       1.002942     1.005045     0.977985     1.008103
min      -3.156609    -3.157014    -3.382695    -2.979173
25%      -0.668176    -0.667688    -0.622163    -0.665823
50%       0.007519    -0.021947     0.056705     0.071004
75%       0.659023     0.654782     0.728197     0.675949
max       3.071309     2.966981     3.526471     3.268658

In [89]:
col=data[2]
col

0      1.249113
1     -1.594452
2      0.039917
3     -0.034589
4      0.395325
         ...
995   -0.398095
996   -0.626059
997   -1.377794
998   -0.576234
999   -0.559720
Name: 2, Length: 1000, dtype: float64

In [83]:
col[np.abs(col)>3]

87     3.014566
279   -3.769392
598    3.216885
781    3.331723
Name: 2, dtype: float64

In [84]:
data[(np.abs(data)>3).any(1)]#mutlak değeri 3 üstünde olan herhangi bir değer içeren satırlar

            0         1         2         3
32   0.186547 -0.766388  3.526471 -0.041306
170 -0.864697 -3.157014  0.397191 -1.268578
453  3.001620  0.690622 -0.352416 -1.286018
481 -0.194348 -0.644102 -3.382695  0.499227
706 -3.156609 -0.845611 -0.669156  0.012266
825  0.589254 -3.015686 -1.862482  0.512388
857 -0.247102 -0.549458  0.138994  3.268658
870  3.071309 -0.332851  0.958772  0.189635

In [85]:
data[np.abs(data)>3]=np.sign(data)*3

In [86]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.013261    -0.006626     0.051618     0.004864
std       1.002238     1.004517     0.974980     1.007268
min      -3.000000    -3.000000    -3.000000    -2.979173
25%      -0.668176    -0.667688    -0.622163    -0.665823
50%       0.007519    -0.021947     0.056705     0.071004
75%       0.659023     0.654782     0.728197     0.675949
max       3.000000     2.966981     3.000000     3.000000

In [90]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0  1.0 -1.0 -1.0
2  1.0 -1.0  1.0  1.0
3 -1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0 -1.0

Np.sign:Verilerdeki değerlerin pozitif veya negatif olmasına bağlı olarak 1 ve –1 değerleri üretir:

### **Permutation and Random Sampling**

In [94]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [92]:
sampler=np.random.permutation(5)

In [93]:
sampler

array([3, 1, 0, 2, 4])

In [95]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [96]:
df.take(sampler)

    0   1   2   3
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

In [97]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
2   8   9  10  11

In [100]:
choices = pd.Series([5, 7, -1, 6, 4])

In [101]:
draws=choices.sample(n=10,replace=True)

In [102]:
draws

2   -1
4    4
2   -1
4    4
0    5
2   -1
2   -1
4    4
3    6
0    5
dtype: int64

### **Computing Indicator/Dummy Variables**

In [103]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)
})

In [104]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [109]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [107]:
df_with_dummy=df[['data1']].join(dummies)

In [108]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [110]:
mnames=['movie_id','title','genres']

In [112]:
movies=pd.read_table('../datasets/movielens/movies.dat', sep='::',header=None,
                    names=mnames)

In [113]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [114]:
all_genres=[]

In [115]:
movies.genres

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                     Comedy|Romance
3                       Comedy|Drama
4                             Comedy
                    ...
3878                          Comedy
3879                           Drama
3880                           Drama
3881                           Drama
3882                  Drama|Thriller
Name: genres, Length: 3883, dtype: object

In [116]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

**Extend () yöntemi**, bir yinelenebilir öğenin (liste, tuple, dize vb.) Tüm öğelerini listenin sonuna ekler.     
**split () yöntemi**, belirtilen dizeyi belirtilen ayırıcıyla ayırdıktan sonra dizelerin bir listesini döndürür.

In [118]:
genres=pd.unique(all_genres)#unique=benzersiz değerleri döndürür

In [119]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [122]:
zero_matrix=np.zeros((len(movies),len(genres)))
#(movies'in öğe sayısı , genres'in öğe sayısı ) boyutunda 0'lardan oluşan numpy array'i oluşturdu

In [124]:
dummies=pd.DataFrame(zero_matrix,columns=genres)

In [125]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [128]:
gen=movies.genres[0]
gen

"Animation|Children's|Comedy"

In [127]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [130]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [133]:
movies.genres

0        Animation|Children's|Comedy
1       Adventure|Children's|Fantasy
2                     Comedy|Romance
3                       Comedy|Drama
4                             Comedy
                    ...
3878                          Comedy
3879                           Drama
3880                           Drama
3881                           Drama
3882                  Drama|Thriller
Name: genres, Length: 3883, dtype: object

In [131]:
for i,gen in enumerate(movies.genres):#
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

**Enumerate () yöntemi**, yinelenebilir bir sayaç ekler ve onu bir numaralandırma nesnesi biçiminde döndürür.

In [132]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [134]:
movies_windic=movies.join(dummies.add_prefix('Genre_'))

In [135]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [136]:
values=np.random.seed(12345)

**seed()Yöntem**, rasgele sayı üreteci başlatmak için kullanılır.

Rastgele sayı üretecinin, rastgele bir sayı oluşturabilmesi için, başlamak üzere bir sayıya (bir çekirdek değer) ihtiyacı vardır.

In [137]:
values=np.random.rand(10)

In [138]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [139]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [140]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## **7.3 String Manipulation**

### **String Object Methods**

In [27]:
val='a,b, guido'

In [28]:
val.split(',')

['a', 'b', ' guido']

In [29]:
pieces=[x.strip() for x in val.split(',')]

**Strip () yöntemi**, hem baştaki hem de sondaki karakterleri kaldırarak dizenin bir kopyasını döndürür (iletilen dize bağımsız değişkenine göre).

In [30]:
pieces

['a', 'b', 'guido']

In [31]:
first,second,third=pieces

In [32]:
first+"::"+second+"::"+third

'a::b::guido'

In [33]:
"::".join(pieces)

'a::b::guido'

In [34]:
"guido" in val

True

In [35]:
val

'a,b, guido'

In [36]:
val.index(",")

1

In [37]:
val.find(":")

-1

**Find () yöntemi,** belirtilen değerin ilk oluşumunu bulur.
Değer bulunmazsa find () yöntemi -1 döndürür.

In [15]:
val.index(":")

ValueError: substring not found

In [38]:
val.count(",")# oluşum sayısını döndürür

2

In [39]:
val.replace(',','::')

'a::b:: guido'

In [40]:
val.replace(",","")

'ab guido'

### **Regular Expressions**

In [41]:
import re

In [42]:
text="foo bar\t baz\tqux"

In [43]:
text

'foo bar\t baz\tqux'

In [44]:
re.split("\s+",text)

['foo', 'bar', 'baz', 'qux']

In [45]:
regex=re.compile("\s+")

In [46]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [47]:
regex.findall(text)

[' ', '\t ', '\t']

In [49]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [50]:
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [53]:
#re.IGNORECASE normal ifadeyi büyük/küçük harfe duyarlı hale getirir
regex=re.compile(pattern,flags=re.IGNORECASE)

In [54]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [55]:
m=regex.search(text)

In [56]:
m

In [57]:
text[m.start():m.end()]

'dave@google.com'

In [58]:
print(regex.match(text))

None

In [59]:
print(regex.sub("REDACTED",text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [60]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [61]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [62]:
m=regex.match("wesm@bright.net")

In [63]:
m.groups()

('wesm', 'bright', 'net')

In [64]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [67]:
print(regex.sub(r'Username:\1, Domain:\2, Suffix:\3',text))

Dave Username:dave, Domain:google, Suffix:com
Steve Username:steve, Domain:gmail, Suffix:com
Rob Username:rob, Domain:gmail, Suffix:com
Ryan Username:ryan, Domain:yahoo, Suffix:com

### **Vectorized String Functions in pandas**

In [69]:
import numpy as np
data={'Dave':'dave@google.com','Steve':'steve@gmail.com',
     'Rob':'rob@gmail.com','Wes':np.nan}

In [71]:
import pandas as pd
data=pd.Series(data)

In [72]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [73]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [75]:
data.str.contains("gmail")#her e-posta adresinin içinde gmail varmı kontrol ediyor

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [76]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [77]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [78]:
matches=data.str.match(pattern,flags=re.IGNORECASE)

In [79]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [80]:
matches.str.get(1)

AttributeError: Can only use .str accessor with string values!

In [81]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

## **7.4 Conclusion**